# CannotPlacePathReinforcementWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..CannotPlacePathReinforcementWarn Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Can't find a host for Path Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlacePathReinforcementWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlacePathReinforcementWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlacePathReinforcementWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace